morningCPU/Mini_tracked_vehicle/tank_esp32cam/src/app_httpd(1).cpp
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
            if (httpd_query_key_value(buf, "cmd", cmd, sizeof(cmd)) == ESP_OK) {
              
            } else {
                free(buf);
                Serial.print("*");
                Serial.println(ESP_FAIL);
                httpd_resp_send_404(req);
                return ESP_FAIL;
            }
        } else {
            free(buf);
            Serial.print("**");
            Serial.println(ESP_FAIL);
            httpd_resp_send_404(req);
            return ESP_FAIL;
        }
        free(buf);
        
    } else {
        Serial.print("***");
        Serial.println(ESP_FAIL);
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }

    int res = 0;

    if(!strcmp(cmd, "F")) {
      Serial.println("Forward");
      // digitalWrite(DRV_A, LOW);
      // digitalWrite(DRV_B, HIGH);
      // digitalWrite(DIR_A, LOW);
      // digitalWrite(DIR_B, HIGH);

      analogWrite(DRV_A, 0);
      analogWrite(DRV_B, speed1);
      analogWrite(DIR_A, 0);
      analogWrite(DIR_B, speed2);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "B")) {
      Serial.println("Backward");
      // digitalWrite(DRV_A, HIGH);
      // digitalWrite(DRV_B, LOW);
      // digitalWrite(DIR_A, HIGH);
      // digitalWrite(DIR_B, LOW);
      analogWrite(DRV_A, speed1);
      analogWrite(DRV_B, 0);
      analogWrite(DIR_A, speed2);
      analogWrite(DIR_B, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "L")) {
      Serial.println("Turn Left");
      // digitalWrite(DRV_A, HIGH);
      // digitalWrite(DRV_B, LOW);
      // digitalWrite(DIR_A, LOW);
      // digitalWrite(DIR_B, HIGH);
      analogWrite(DRV_A, speed1);
      analogWrite(DRV_B, 0);
      analogWrite(DIR_A, 0);
      analogWrite(DIR_B, speed2);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "R")) {
      Serial.println("Turn Right");

      analogWrite(DRV_A, 0);
      analogWrite(DRV_B, speed1);
      analogWrite(DIR_A, speed2);
      analogWrite(DIR_B, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "G")) {
      Serial.println("Forward Left");

      analogWrite(DRV_A, 0);
      analogWrite(DRV_B, 0);
      analogWrite(DIR_A, 0);
      analogWrite(DIR_B, speed2);

      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "H")) {
      Serial.println("Backward Left");

      analogWrite(DRV_A, speed1);
      analogWrite(DRV_B, 0);
      analogWrite(DIR_A, 0);
      analogWrite(DIR_B, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "I")) {
      Serial.println("Forward Right");

      analogWrite(DRV_A, 0);
      analogWrite(DRV_B, speed1);
      analogWrite(DIR_A, 0);
      analogWrite(DIR_B, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "J")) {
      Serial.println("Backward Right");

      analogWrite(DRV_A, 0);
      analogWrite(DRV_B, 0);
      analogWrite(DIR_A, speed2);
      analogWrite(DIR_B, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "S")) {
      Serial.println("Stop");

      analogWrite(DRV_A, 0);
      analogWrite(DRV_B, 0);
      analogWrite(DIR_A, 0);
      analogWrite(DIR_B, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    // else if(!strcmp(cmd, "V")) {
    //   Serial.println("Horn On");
    //   digitalWrite(buzzerPin, HIGH);
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, "OK", 2);
    // }
    
    // else if(!strcmp(cmd, "v")) {
    //   Serial.println("Horn Off");
    //   digitalWrite(buzzerPin, LOW);
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, "OK", 2);
    // }
    else if(!strcmp(cmd, "T")) {
      speed1=105;   //左
      speed2=105;
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    else if(!strcmp(cmd, "Y")) {
      speed1=165;
      speed2=165;
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }        
    else if(!strcmp(cmd, "U")) {
      speed1=255;
      speed2=255;
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }  
    // else if(!strcmp(cmd, "W")) {
    //   Serial.println("LED On");
    //   ledcWrite(7, ledVal);
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, "OK", 2);
    // }
    
    else if(!strcmp(cmd, "w")) {
      Serial.println("LED Off");
      ledcWrite(7, 0);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    
    // else if (!strcmp(cmd, "x")){
    //   Serial.println("Flash Light : Low (20)");
    //   ledVal = 20;
    //   ledcWrite(7, ledVal);
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, "OK", 2);
    // }
    // else if (!strcmp(cmd, "y")){
    //   Serial.println("Flash Light : Medium (50)");
    //   ledVal = 50;
    //   ledcWrite(7, ledVal);
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, "OK", 2);
    // }
    // else if (!strcmp(cmd, "z")){
    //   Serial.println("Flash Light : Bright (100)");
    //   ledVal = 100;
    //   ledcWrite(7, ledVal);
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, "OK", 2);
    // }    
    else if (!strcmp(cmd, "Z")){
      Serial.println("Flash Light : Super Bright (255)");
      ledVal = 255;
      ledcWrite(7, ledVal);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }   
    

