morningCPU/Mini_tracked_vehicle/tank_esp32cam/src/app_httpd(1).cpp
    else if (!strcmp(cmd, "a")){
      Serial.println("Servo q (0)");
      // ledcWrite(8, 400);

      myservo.write(110);
      delay(100);
      myservo.write(90);
      delay(100);
      digitalWrite(servoPin, LOW);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }
    else if (!strcmp(cmd, "b")){
      Serial.println("Servo q (6500)");
      // ledcWrite(8, 6000);
      myservo.write(70);
      delay(100);
      myservo.write(90);
      delay(100);
      digitalWrite(servoPin, LOW);
      httpd_resp_set_type(req, "text/html");
      return httpd_resp_send(req, "OK", 2);
    }

    // else if (!strcmp(cmd, "n")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataT=EEPROM.read(EEPROM_speedT);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataT);
    //   if (EEPROM_dataT<60)
    //     EEPROM_dataT=EEPROM_dataT+1;
    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataT);
    //   EEPROM.write(EEPROM_speedT,EEPROM_dataT);
    //   EEPROM.commit();

    //   String response = String(EEPROM_dataT); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req,response.c_str(), response.length());
    // }

    // else if (!strcmp(cmd, "m")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataT=EEPROM.read(EEPROM_speedT);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataT);
    //   if (EEPROM_dataT>0)
    //     EEPROM_dataT=EEPROM_dataT-1;
    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataT);
    //   EEPROM.write(EEPROM_speedT,EEPROM_dataT);
    //   EEPROM.commit();

    //   String response = String(EEPROM_dataT); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, response.c_str(), response.length());
    // }

    // else if (!strcmp(cmd, "h")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataT=EEPROM.read(EEPROM_speedT);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataT);

    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataT);
    //   EEPROM.write(EEPROM_speedT,EEPROM_dataT);
    //   EEPROM.commit();

    //   speed1=125+EEPROM_dataT;
    //   speed2=155;

    //   String response = String(EEPROM_dataT); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req,"OK", 2);
    // }

    // else if (!strcmp(cmd, "j")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataY=EEPROM.read(EEPROM_speedY);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataY);
    //   if (EEPROM_dataY>0)
    //     EEPROM_dataY=EEPROM_dataY+1;
    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataY);
    //   EEPROM.write(EEPROM_speedY,EEPROM_dataY);
    //   EEPROM.commit();
    //   //  speed1=speed1d+EEPROM_data;
    //   String response = String(EEPROM_dataY); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, response.c_str(), response.length());
    // }
    // else if (!strcmp(cmd, "k")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataY=EEPROM.read(EEPROM_speedY);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataY);
    //   if (EEPROM_dataY>0)
    //     EEPROM_dataY=EEPROM_dataY-1;
    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataY);
    //   EEPROM.write(EEPROM_speedY,EEPROM_dataY);
    //   EEPROM.commit();
    //   //  speed1=speed1d+EEPROM_data;
    //   String response = String(EEPROM_dataY); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, response.c_str(), response.length());
    // }

    // else if (!strcmp(cmd, "i")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataU=EEPROM.read(EEPROM_speedU);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataU);
    //   if (EEPROM_dataU>0)
    //     EEPROM_dataU=EEPROM_dataU+1;
    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataU);
    //   EEPROM.write(EEPROM_speedU,EEPROM_dataU);
    //   EEPROM.commit();
    //   //  speed1=speed1d+EEPROM_data;
    //   String response = String(EEPROM_dataU); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, response.c_str(), response.length());
    // }

    // else if (!strcmp(cmd, "o")){
    //   EEPROM.begin(EEPROM_Size);  //开启EEPROM
    //   EEPROM_dataU=EEPROM.read(EEPROM_speedU);
    //   Serial.printf("last_EEPROM_speed:%d",EEPROM_dataU);
    //   if (EEPROM_dataU>0)
    //     EEPROM_dataU=EEPROM_dataU-1;
    //   Serial.printf("now_EEPROM_speed:%d",EEPROM_dataU);
    //   EEPROM.write(EEPROM_speedU,EEPROM_dataU);
    //   EEPROM.commit();
    //   //  speed1=speed1d+EEPROM_data;
    //   String response = String(EEPROM_dataU); // 将整数转换为字符串
    //   httpd_resp_set_type(req, "text/html");
    //   return httpd_resp_send(req, response.c_str(), response.length());
    // }


    
    else {
        res = -1;
    }

    if(res){
        return httpd_resp_send_500(req);
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
}




// static esp_err_t data_handler(httpd_req_t *req) {
//     char buf[1024];  // 增加缓冲区大小
//     int ret, remaining = req->content_len;

//     char request_data[1024];  // 增加缓冲区大小
//     int data_index = 0;

//     while (remaining > 0) {
//         ret = httpd_req_recv(req, buf, MIN(remaining, sizeof(buf)));
//         if (ret <= 0) {
//             if (ret == HTTPD_SOCK_ERR_TIMEOUT) {
//                 httpd_resp_send_408(req);
//             } else {
//                 httpd_resp_send_500(req);
            
//             return ESP_FAIL;
//         }

//         for (int i = 0; i < ret; i++) {
//             request_data[data_index] = buf[i];
//             data_index++;
//         }

//         remaining -= ret;
//     }

//     // 解析JSON数据
//     cJSON *root = cJSON_Parse(request_data);
//     if (root == NULL) {
//         // JSON解析失败
//         httpd_resp_send_500(req);
//         return ESP_FAIL;
//     }

//     // 获取JSON对象中的数据项
//     cJSON *value1 = cJSON_GetObjectItem(root, "value1");
//     cJSON *value2 = cJSON_GetObjectItem(root, "value2");

//     if (value1 == NULL || value2 == NULL) {
//         // JSON数据项不存在
//         //httpd_resp_send_400(req);  // 使用400 Bad Request
//         httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Bad Request");
//         cJSON_Delete(root);
//         return ESP_FAIL;
//     }

//     // 将数据项转换为整数
//     int intValue1 = value1->valueint;
//     int intValue2 = value2->valueint;

//     // 打印解析后的数据
//     printf("Received JSON data - value1: %d, value2: %d\n", intValue1, intValue2);

//     cJSON_Delete(root);

//     // 发送响应给客户端
//     httpd_resp_set_type(req, "text/plain");
//     httpd_resp_send(req, "JSON data received and processed", -1);

//     return ESP_OK;
// }
// }


 

// 这是启动相机服务器的函数，它会注册URI处理程序，包括视频流处理程序
void startCameraServer(){
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t state_uri = {
        .uri       = "/state",
        .method    = HTTP_GET,
        .handler   = state_handler,
        .user_ctx  = NULL
    };
    // httpd_uri_t data_uri = {
    // .uri       = "/data",
    // .method    = HTTP_GET,
    // .handler   = data_handler,
    // .user_ctx  = NULL
    // };

    Serial.printf("Starting web server on port: '%d'", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &state_uri);
        // httpd_register_uri_handler(camera_httpd, &data_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}